In [1]:
import pandas as pd
import numpy as np
from numpy import nan as NA

# Handling Missing Data

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

# Fltering Out Missing Data

In [6]:
data = pd.Series([1,NA, 3.5,NA,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [7]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [9]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [10]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [11]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [12]:
data[4]=NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [13]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0 -0.470419 -0.472831 -0.848070
1 -1.998794 -0.403329  0.075866
2  0.482496 -1.249057  0.155032
3  0.967330  0.284631  2.040830
4  0.760563  0.225573 -0.108233
5 -0.220343  0.037216  1.101113
6  1.687978 -1.102490 -0.701953

In [15]:
df.iloc[:4, 1] = NA
df

          0         1         2
0 -0.470419       NaN -0.848070
1 -1.998794       NaN  0.075866
2  0.482496       NaN  0.155032
3  0.967330       NaN  2.040830
4  0.760563  0.225573 -0.108233
5 -0.220343  0.037216  1.101113
6  1.687978 -1.102490 -0.701953

In [16]:
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.470419       NaN       NaN
1 -1.998794       NaN       NaN
2  0.482496       NaN  0.155032
3  0.967330       NaN  2.040830
4  0.760563  0.225573 -0.108233
5 -0.220343  0.037216  1.101113
6  1.687978 -1.102490 -0.701953

In [17]:
df.dropna()

          0         1         2
4  0.760563  0.225573 -0.108233
5 -0.220343  0.037216  1.101113
6  1.687978 -1.102490 -0.701953

In [18]:
df.dropna(thresh=2)

          0         1         2
2  0.482496       NaN  0.155032
3  0.967330       NaN  2.040830
4  0.760563  0.225573 -0.108233
5 -0.220343  0.037216  1.101113
6  1.687978 -1.102490 -0.701953

# Filling In Missing Data

In [19]:
df.fillna(0)

          0         1         2
0 -0.470419  0.000000  0.000000
1 -1.998794  0.000000  0.000000
2  0.482496  0.000000  0.155032
3  0.967330  0.000000  2.040830
4  0.760563  0.225573 -0.108233
5 -0.220343  0.037216  1.101113
6  1.687978 -1.102490 -0.701953

In [20]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.470419  0.500000  0.000000
1 -1.998794  0.500000  0.000000
2  0.482496  0.500000  0.155032
3  0.967330  0.500000  2.040830
4  0.760563  0.225573 -0.108233
5 -0.220343  0.037216  1.101113
6  1.687978 -1.102490 -0.701953

In [21]:
df.fillna(0, inplace=True)

In [22]:
df

          0         1         2
0 -0.470419  0.000000  0.000000
1 -1.998794  0.000000  0.000000
2  0.482496  0.000000  0.155032
3  0.967330  0.000000  2.040830
4  0.760563  0.225573 -0.108233
5 -0.220343  0.037216  1.101113
6  1.687978 -1.102490 -0.701953

In [23]:
df = pd.DataFrame(np.random.randn(6, 3))
df

          0         1         2
0  1.063807  0.989391 -1.073915
1 -1.349094 -0.993246  0.357562
2  0.879254 -1.283017  0.436039
3  1.078084  1.132281 -0.120435
4  1.071392 -0.251270 -0.600797
5 -0.700187  1.749962 -0.097710

In [24]:
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  1.063807  0.989391 -1.073915
1 -1.349094 -0.993246  0.357562
2  0.879254       NaN  0.436039
3  1.078084       NaN -0.120435
4  1.071392       NaN       NaN
5 -0.700187       NaN       NaN

In [25]:
df.fillna(method='ffill')

C:\Users\shyam\AppData\Local\Temp\ipykernel_12920\1193302488.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

          0         1         2
0  1.063807  0.989391 -1.073915
1 -1.349094 -0.993246  0.357562
2  0.879254 -0.993246  0.436039
3  1.078084 -0.993246 -0.120435
4  1.071392 -0.993246 -0.120435
5 -0.700187 -0.993246 -0.120435

In [26]:
df.fillna(method='ffill', limit = 2)

C:\Users\shyam\AppData\Local\Temp\ipykernel_12920\1234214557.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', limit = 2)

          0         1         2
0  1.063807  0.989391 -1.073915
1 -1.349094 -0.993246  0.357562
2  0.879254 -0.993246  0.436039
3  1.078084 -0.993246 -0.120435
4  1.071392       NaN -0.120435
5 -0.700187       NaN -0.120435

In [27]:
data = pd.Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [28]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# Data Transformation

## Removing duplicates

In [29]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [30]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [31]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [32]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [33]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [34]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

# Transforming Data Using a function or mapping

In [35]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
 ....: 'Pastrami', 'corned beef', 'Bacon',
 ....: 'pastrami', 'honey ham', 'nova lox'],
 ....: 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [36]:
meat_to_animal = {
 'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'
}

In [37]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [38]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

# Replacing Values

In [39]:
data= pd.Series ([1.,-999.,2.,-999.,-1000.,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [40]:
data.replace(-999,NA)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [41]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [42]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [43]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

# Renaming Axis Indexes

In [44]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), index=['Ohio', 'Colorado', 'New York'], columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [45]:
transform = lambda x :x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [46]:
data.index= data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [47]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [48]:
data.rename(index={'OHIO': 'INDIANA'}, columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [49]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

# Discreation n Binning

Continuous data is often discretized or otherwise separated into bins for analysis. Suppose you have data about a group of people in a study, and you want to group them into discrete age buckets:

In [50]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

Lets divide these into bins of 18 to 25, 26 to 35, 36 to 60, and finally 61 and older. To do so, you have to use cut, a function in pandas:

In [51]:
bins = [18,25,35,60,100]
cats=  pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

[18, 26): Includes 18 but excludes 26.
[26, 36): Includes 26 but excludes 36.
[36, 61): Includes 36 but excludes 61.
[61, 100): Includes 61 but excludes 100.

Interval Notation: Square brackets ([ or ]) denote inclusive boundaries, while parentheses (( or )) denote exclusive boundaries.
Default Behavior: By default, pd.cut creates bins with the right boundary inclusive.

In [52]:
pd.value_counts(cats)

C:\Users\shyam\AppData\Local\Temp\ipykernel_12920\1485279302.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [53]:
pd.cut(ages,[18,26,36,61,100],right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [54]:
group_name = ['Youth','YoungAdult','MiddleAged','Senior']
pd.cut(ages,bins, labels=group_name)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [55]:
data = np.random.rand(20)
data

array([0.68267558, 0.45723025, 0.62524139, 0.16932607, 0.98879278,
       0.45909638, 0.15107288, 0.213267  , 0.74505263, 0.73337603,
       0.43891404, 0.04155894, 0.75429113, 0.37450402, 0.09309035,
       0.26334919, 0.85085907, 0.71850193, 0.21226422, 0.89212568])

In [56]:
pd.cut(data, 4, precision=2)

[(0.52, 0.75], (0.28, 0.52], (0.52, 0.75], (0.041, 0.28], (0.75, 0.99], ..., (0.041, 0.28], (0.75, 0.99], (0.52, 0.75], (0.041, 0.28], (0.75, 0.99]]
Length: 20
Categories (4, interval[float64, right]): [(0.041, 0.28] < (0.28, 0.52] < (0.52, 0.75] < (0.75, 0.99]]

The precision=2 option limits the decimal precision to two digits.

In [57]:
data = np.random.randn(1000)
data

array([ 1.99955110e-01, -6.59367228e-01, -4.05654900e-01,  1.39180194e-02,
       -2.13073599e+00,  7.51810101e-01, -6.30575432e-01, -2.29399581e-03,
       -1.58577889e-02,  4.17554358e-01,  4.46627635e-01,  6.08281777e-01,
        5.11925450e-01, -7.64290454e-01, -1.81995903e+00, -1.07698068e+00,
        4.78412786e-01, -1.65084778e+00, -4.50912374e-01,  1.12015374e+00,
        3.20129043e-02, -1.28998088e+00,  5.16717859e-01,  1.62542631e+00,
       -1.82420392e-01,  7.48916955e-01, -2.51262530e-01,  4.09670609e-01,
       -8.69043742e-01, -2.95673296e+00, -6.65475567e-01,  2.15213840e-02,
        1.07839497e+00, -6.70194994e-01, -2.06978299e+00, -7.30401906e-01,
       -4.14011443e-01,  1.69801963e-01,  2.11040563e-01,  5.81446657e-01,
        5.83506434e-01,  1.06018899e+00,  4.10376531e-01,  1.00332841e+00,
       -8.06391715e-01,  8.76594174e-02,  2.67085555e-01,  6.91258492e-01,
        1.01750984e+00,  1.64620643e-01, -1.83948659e-01, -2.01971893e-02,
       -1.89603545e+00,  3.40958599e-01, -7.69729455e-01, -7.68013825e-01,
       -3.94813010e-01, -7.26801741e-01,  9.02430047e-01, -4.06416906e-01,
        1.35884996e+00,  9.96166388e-01, -6.48647429e-01, -3.94147941e-01,
       -3.13640661e-01,  8.89560732e-01, -4.87260977e-01,  3.49076375e-01,
        1.50279578e-02, -3.17306204e-01, -1.36864525e+00, -2.21197849e+00,
       -4.63834959e-01, -7.49068462e-01, -2.97809693e-02, -1.10028237e+00,
       -1.08650702e+00,  1.31086572e+00,  3.61141321e-01, -1.02949304e+00,
       -5.91133256e-01, -2.03418694e-01,  3.74446563e-01,  2.29667426e-01,
       -1.66190782e+00, -1.80743375e-01,  2.45823923e+00, -3.46108488e-01,
       -4.09571218e-01,  7.73535949e-01, -1.11651023e+00,  2.29853526e-01,
        1.18111881e+00, -8.41127580e-01, -2.15197298e+00, -1.03304899e+00,
       -5.01025916e-01,  6.20601333e-01, -2.60244634e-02, -2.13161932e+00,
        7.95384683e-02,  1.39296158e+00, -1.05986443e+00, -7.78203805e-01,
        6.04792440e-01,  7.59403416e-01, -1.17939434e+00,  1.45053826e-01,
       -2.15248184e+00, -5.38125523e-01, -3.22288575e-03,  3.03459755e-01,
       -6.27792118e-01,  1.72138265e+00, -7.35922037e-02,  2.34045068e-01,
        3.99888558e-01, -5.71128531e-01, -9.87425178e-01,  4.18308565e-01,
       -5.38992633e-01, -8.82312936e-02, -1.13928972e+00, -3.99734769e-01,
       -2.60870651e+00, -1.21587748e+00, -7.13384491e-02, -5.00402805e-01,
        2.98793484e-01, -1.26176689e+00,  2.92884851e-02,  1.27913409e+00,
        8.45552358e-01,  1.85273454e+00,  1.18669931e-01,  1.80462250e+00,
       -2.16039826e-01,  1.13844753e+00, -8.61661798e-01, -1.17171830e+00,
        4.54990288e-01, -8.59849622e-01, -1.36461861e-01,  1.62101107e+00,
        2.40917923e-01, -6.46220324e-01, -3.71509921e-01,  3.94124895e-01,
       -1.23031265e-01,  4.28378999e-01, -5.83647815e-01, -2.96305761e-01,
        9.59948705e-01, -4.99665056e-01,  1.50286886e-01,  7.75431286e-01,
       -9.12326455e-01,  1.36232639e+00, -3.02949277e-02,  7.59032830e-01,
        9.54080112e-01,  1.28750154e+00,  5.42619782e-01,  1.50893377e+00,
        4.64864020e-01,  5.25272259e-02, -5.84367664e-01,  4.54300923e-01,
        3.75595001e-01,  1.62373528e+00,  6.75704465e-01,  3.48787490e-03,
        6.56518622e-01, -7.86346462e-02, -5.26076415e-01, -3.29125936e-01,
        5.88963514e-01, -1.17618469e+00, -9.59324011e-01,  3.07085911e-01,
       -4.28457784e-01, -3.24678668e-01,  1.37083604e+00,  7.88282873e-01,
       -1.34948915e-01, -5.41763025e-01, -5.61088562e-01, -5.56913263e-01,
       -1.72694206e+00, -3.40142992e-01, -5.92522308e-01,  5.78956283e-01,
        1.53848588e+00,  7.34692538e-01, -6.98284453e-01,  3.89151788e-01,
       -2.87420259e-02, -1.08424942e+00,  3.16439960e-01, -7.20769903e-01,
        1.18480409e+00, -1.54400766e+00,  4.80255954e-01,  1.53508984e+00,
       -6.41105237e-01, -1.37682738e+00, -6.84850006e-01, -6.13434297e-01,
       -5.71854845e-01, -5.64023950e-01,  1.87443274e-01,  3.99426524e-01,
       -5.90738495e-01,  3.09617372e-01,  1.65859556e-01, -1.93213931e-01,
       -1.34072794e+00, -9.74060078e-01, -3.92425150e-01, -3.82773765e-01,
        6.26026920e-01,  4.28261740e-01, -1.65041849e-01,  1.17139877e+00,
       -2.62832531e-01, -8.89995035e-02,  1.03626953e+00, -1.98707749e-01,
        1.06122791e+00, -5.12371378e-01,  7.25644168e-01,  5.98807480e-01,
        1.21486565e+00, -8.55748345e-02, -8.92978990e-01, -1.13103682e+00,
        4.23853410e-01,  1.14459484e+00, -1.36284563e+00,  4.27323572e-01,
        4.87822247e-01,  1.79219628e-02,  7.22313546e-01, -3.68098108e-01,
        1.18753785e+00,  1.06526806e+00, -3.83724486e-01, -3.89674561e-01,
        1.60205707e+00, -1.97924126e-01,  2.63566020e+00,  2.09553751e+00,
       -8.05569144e-01,  1.17389031e-01, -1.21177226e+00, -1.48833685e+00,
        5.90632713e-01, -7.81651297e-01,  2.84055180e-01, -7.53133565e-01,
        6.96734013e-01,  7.60576738e-01, -1.68506285e+00, -1.60110299e+00,
       -1.61138862e+00, -6.02763878e-01,  7.33519624e-02,  3.73994741e-01,
        6.90304342e-01,  1.46801544e-01,  1.00176582e-01, -3.10032435e-01,
        1.33585606e-01, -1.37651699e-01, -8.45758636e-01, -1.76361257e-01,
       -3.61130865e-01,  1.02618723e+00, -1.45322881e+00, -1.14516688e+00,
       -2.15599986e+00,  4.90788176e-01,  9.71407964e-01,  7.12363861e-01,
        1.05024017e+00,  2.87274815e-01, -1.79142258e+00,  7.52009850e-01,
        9.78192782e-01,  6.20359764e-01, -1.02809733e+00,  1.97046242e-01,
       -7.06624132e-01, -3.33595982e+00, -3.89405214e-01,  5.63757584e-02,
        2.07988322e+00,  3.69161288e-01, -9.79030983e-01, -1.04832508e+00,
       -4.22926258e-01,  8.10929428e-01,  1.12726305e+00, -1.27485481e+00,
        2.10794403e+00,  2.56811845e-01, -2.33730573e-01,  3.85219328e-01,
        4.47738388e-01, -8.10686382e-04,  3.52052263e-01,  8.31346292e-01,
        5.20741585e-01, -6.17822787e-01,  2.87863309e+00,  5.52618681e-01,
        1.40673426e+00, -1.39409030e+00, -6.94629954e-01,  4.31583840e-01,
       -4.18288225e-01,  4.10796130e-01, -1.83413017e+00,  3.83088173e-01,
       -5.82582743e-01,  1.21862388e-01,  1.33579575e-02,  5.43334859e-01,
        5.21338894e-01, -6.76628488e-03, -5.59970864e-01,  9.07417204e-01,
       -4.96049104e-01,  3.24086993e-01,  9.12377345e-01,  5.98959247e-01,
       -3.72949768e-01, -2.50070593e-01,  1.25684052e+00, -8.05833760e-01,
        8.44420525e-01, -1.04675397e+00,  5.69920850e-01,  1.23848974e-01,
       -9.09089044e-01, -6.85956229e-01, -1.63938049e+00,  4.85879981e-01,
        5.87733201e-01, -5.79955460e-01, -1.31972466e-01, -1.04495946e+00,
       -3.16012999e-01,  2.13193282e+00,  1.49777073e+00,  7.97964713e-01,
        4.20647717e-01,  7.13207360e-02,  1.68451143e+00,  2.17911562e-01,
       -1.82451203e+00,  2.18416628e-01,  1.09077689e+00, -7.90145971e-01,
       -4.10697083e-02,  9.22093300e-01, -5.93578716e-01, -5.54935621e-01,
        1.22458841e-01, -1.24421014e-01, -1.01161132e+00, -2.30121133e-01,
       -3.84141263e-01, -3.08679783e-01, -9.97555058e-01,  3.90529603e-02,
       -1.68505451e-01, -2.00358809e-01, -1.00098725e+00, -3.16983922e-01,
        8.73181753e-01, -4.86780024e-01,  1.91300779e+00, -3.46555078e-01,
        9.44151784e-01, -1.19642327e-01, -4.04883955e-01, -1.41409488e+00,
       -1.91466894e+00,  5.44122701e-01,  1.32448869e-02, -9.28091884e-02,
       -9.81617082e-01,  2.89954315e-02,  5.33416255e-01, -1.24763056e+00,
        9.55383388e-01, -3.17561547e-01,  2.12438514e+00,  4.67856853e-01,
       -8.04686152e-01, -4.95841472e-01,  2.14172651e-01, -7.73554999e-01,
       -6.63132709e-01,  8.41478059e-01,  4.55919022e-01, -3.01023792e-01,
        4.22184376e-01, -1.96156241e-01, -1.20529990e+00, -4.46963145e-01,
        6.33839181e-01,  1.68161560e-02,  2.40195327e-02,  8.43472854e-01,
        1.66875448e+00,  2.51951820e+00, -1.56946449e+00,  7.68348346e-01,
       -4.75530197e-01, -1.63764080e+00, -1.46255819e+00,  1.96324267e+00,
       -1.11929112e+00,  4.98727397e-01, -3.94355652e-01,  4.20899128e-02,
        5.37190366e-01, -8.92621830e-01, -9.23873375e-01,  5.55474137e-02,
       -2.60877747e-02,  5.59406063e-01,  2.07360744e-02, -1.14423470e+00,
        2.21467033e+00,  1.15286710e+00, -1.78437257e+00,  4.77047472e-01,
       -5.84825537e-01, -1.97088843e+00,  5.01890759e-02, -2.81572161e-01,
       -1.39064179e-01, -5.54501780e-01,  7.89278943e-01,  6.79949375e-01,
        4.84579278e-01,  2.66856507e-01,  7.15664499e-01, -8.32028220e-01,
        9.62215566e-01, -2.37736964e+00, -1.39268778e+00,  9.86047607e-01,
        7.07001474e-01,  7.70581260e-01, -9.82664714e-02,  2.83511117e-01,
        3.59616080e-01, -1.03249729e+00, -1.68169546e+00,  8.14900168e-01,
       -6.65723947e-02, -5.72214343e-01,  3.87559588e-01,  8.45365245e-02,
       -9.30408936e-02,  1.47222805e+00,  5.60114219e-01, -1.73924315e+00,
        1.49199626e+00,  3.91514048e-01,  2.36232524e+00,  9.42235199e-02,
        1.45973803e+00, -6.83481455e-01, -2.80313761e+00,  1.83311083e+00,
        7.12456539e-01,  8.97795372e-01, -1.97569637e-02, -3.28369758e-01,
       -7.22808466e-01, -7.81103729e-01,  3.80673824e-02, -1.92048371e+00,
        8.31321310e-01, -3.34285569e-01, -3.12266109e-01, -7.56239480e-01,
        1.31358593e-01, -7.20162723e-01, -7.34892460e-01,  1.12543541e+00,
       -7.54967275e-01,  9.02459184e-01, -8.59633199e-01, -7.73747725e-01,
       -2.19812608e+00,  1.01551443e+00, -1.96821719e-01, -1.00958587e+00,
        7.68143286e-01,  5.97931081e-01, -1.01594029e+00,  1.29485644e+00,
       -1.38431409e+00, -1.40047263e+00,  3.67077286e-01, -1.91831777e+00,
        9.99991804e-01,  7.01300296e-01, -2.57351945e+00,  1.01768040e+00,
        1.21820098e-02,  4.75219356e-01,  1.06701197e+00, -3.41028717e-01,
       -9.33959555e-01, -2.11833169e+00, -6.15435803e-01,  8.54363156e-01,
       -6.31896219e-01,  9.93766321e-02, -1.68866337e+00,  3.96857893e-01,
        4.07349568e-01,  3.75946563e-01,  9.32667255e-01,  1.93713549e-01,
        6.91177348e-01, -1.08769235e+00, -1.06901552e+00,  4.36017921e-01,
       -1.26457346e-01,  1.90659177e+00, -5.37951368e-01,  1.34562512e+00,
        4.88092393e-01,  1.64859165e+00, -7.99774557e-01, -1.46989960e-01,
        1.02429064e-01,  3.69504842e-01, -1.25995047e+00, -1.42718903e+00,
       -1.25049053e+00, -8.15045368e-01,  1.10196206e+00,  7.03064490e-01,
       -6.17013344e-02, -6.41191270e-01,  6.59446107e-01,  2.27793787e-02,
       -9.54244997e-01, -1.32874308e-01, -4.69748813e-01,  4.85552697e-01,
        6.17463035e-01, -4.34381811e-01, -9.27558880e-01, -4.53048544e-01,
        9.95165736e-01,  3.24933149e-01, -8.88435962e-01,  4.12265052e-01,
        7.97182276e-01, -1.18985632e+00,  5.72154046e-01,  1.32100415e+00,
       -1.22786369e+00, -1.59888731e+00,  1.49169609e+00,  1.28958157e-01,
       -5.93336657e-01,  1.74436491e-01, -4.27236805e-01, -1.42820498e+00,
       -3.24314628e-01, -7.89104649e-01, -6.88956185e-01,  5.87909469e-01,
       -3.86537357e-01, -2.08401392e-01, -1.91123729e+00, -6.45162965e-01,
        8.22784815e-01, -1.66713574e+00,  6.77319131e-01,  4.61175738e-01,
       -1.15199590e+00, -1.05322090e+00,  1.07956041e+00, -1.40634559e-01,
        1.52195142e-02,  4.80463240e-01,  1.62303296e+00, -5.49026124e-01,
       -1.31672837e+00, -1.95972006e-01, -1.82844078e-01, -4.56993940e-01,
        5.79899226e-01, -1.40504985e+00,  9.97115067e-01,  1.42075701e-02,
       -9.90276120e-01,  5.26104892e-01, -1.18197561e+00, -1.18047677e+00,
        1.32085030e+00,  1.03180490e+00,  1.04629043e+00, -4.73096875e-01,
       -8.41912627e-02, -1.32337781e-03,  1.16094111e+00,  6.40546907e-01,
        2.69844005e-01, -2.02046430e+00,  5.31363509e-01,  2.92063988e-01,
        1.74370599e-01,  1.08046242e+00,  6.51555665e-01, -2.37432065e-01,
       -1.04527114e+00, -1.95109222e+00,  2.86833857e-01, -2.65079987e-01,
        8.23350045e-01, -7.73174168e-01, -7.12660603e-01, -1.40812739e+00,
        1.18695881e+00, -4.56516780e-01, -1.09491014e+00,  4.25873776e-02,
        4.54089941e-01,  1.04387642e+00,  2.34727916e-01, -1.55950506e+00,
       -6.32338228e-01,  1.66845863e+00, -6.08010745e-01,  8.54798177e-01,
       -7.79256520e-01,  1.54637465e-01, -1.13611234e+00, -8.93635134e-01,
        5.16662557e-01,  2.57113212e-01,  5.30252012e-01, -1.85577767e+00,
        1.16414141e+00, -1.79987199e+00,  4.69267515e-01,  9.13479868e-03,
       -2.52482399e+00,  7.90702837e-01, -5.00337585e-01,  1.81117093e-01,
       -4.36314650e-01,  3.45709884e-01,  2.57233112e-01, -5.01690452e-01,
       -1.87219449e+00,  5.31106450e-01,  4.44818735e-02,  1.61082807e-01,
        6.85977067e-02, -2.07927968e+00,  1.25404109e+00, -1.34496539e-01,
       -2.87425729e-01, -4.24558821e-02, -4.76456507e-01, -1.21463882e+00,
        1.58223001e+00, -1.03932776e+00,  1.42225675e+00, -2.30491678e-01,
       -6.25561710e-01, -3.32777040e-01, -5.14371660e-02,  4.81697810e-01,
       -1.88913444e-01, -1.01397944e+00,  7.88052364e-01,  3.05004628e-01,
        7.20256867e-01, -1.23554304e+00,  1.25191450e+00,  1.65953367e+00,
        8.53660181e-01,  2.63992136e-01,  2.87421676e-01,  2.51877927e-01,
        1.03707249e-01, -2.06152322e-01,  2.63935008e-01,  4.53620227e-01,
       -1.55728417e+00,  1.29995722e+00, -1.08524446e+00,  1.41142515e+00,
       -5.69759976e-01,  2.48572055e-01, -1.07972590e+00, -1.10090089e-01,
       -3.88480315e-01,  4.60656230e-01, -1.00615336e+00, -1.13609208e+00,
       -9.69202742e-02,  4.21252995e-01,  1.11159161e+00, -3.00449865e-01,
       -8.66160754e-01, -6.56140541e-01, -1.32957831e+00,  8.36840083e-01,
        2.03462782e-01,  1.83220276e-01,  1.45238921e+00,  1.95609153e+00,
       -1.44286010e+00,  5.51734889e-01,  7.25463186e-01, -9.73410754e-01,
       -4.67934694e-01, -7.76246021e-01,  1.05726890e+00,  1.37926623e+00,
       -1.72973797e-01,  5.15202064e-01, -1.01366495e+00,  1.22949050e-01,
       -1.66603763e+00, -1.87745737e-01,  4.68038363e-01,  5.68477131e-02,
        1.05865618e+00, -1.78590760e-01,  3.29867762e-02, -9.51393652e-01,
       -1.23303744e-01, -1.62986982e-01, -4.06047098e-01,  8.47779126e-01,
        6.39737021e-01, -1.58128223e+00,  1.50898469e+00,  8.33791441e-02,
        1.23910492e+00,  1.84675351e+00, -3.65931974e-01,  8.97626828e-01,
        3.11701285e-01, -2.84066439e-02, -1.94322033e-01,  1.59556803e+00,
       -2.42897894e-01,  6.38465255e-01, -4.93630649e-02,  2.71922660e-01,
        9.91749162e-01, -1.67951904e+00,  6.74375064e-01, -1.03896335e+00,
        1.28382899e+00, -1.00318715e-01,  1.96334770e-01,  1.91921349e+00,
        2.63352469e-01,  1.14421455e+00,  1.08236691e+00,  1.45956814e-01,
        1.36854145e+00,  8.15486285e-01,  5.83524163e-01, -1.20233450e+00,
        2.01934908e+00,  1.57656102e+00,  9.53032325e-01,  5.91095458e-01,
        5.12191149e-01, -1.45981469e-01,  2.04999557e-01,  5.96700458e-01,
       -2.18088460e-01,  3.57743995e+00, -5.59942909e-01, -1.82995292e+00,
       -7.80971448e-01,  5.63491132e-01, -1.49758742e+00,  2.10233733e+00,
       -8.19754265e-02,  4.04598691e-01, -1.30601973e+00,  3.99695173e-01,
       -6.76445869e-01, -1.57851538e+00,  9.97043405e-01, -6.98428725e-01,
       -1.04163977e+00, -1.15373999e+00,  6.14856932e-01,  2.00314920e-01,
        2.85738115e-01,  1.28142025e+00,  2.61494028e-01, -8.10634421e-02,
        4.84467683e-01,  2.87959649e-01, -1.34171955e-01,  2.49782795e-01,
       -1.15986184e+00,  4.98172605e-01, -7.69906772e-01, -2.24401249e-01,
        8.33131190e-01, -2.15323866e-01,  4.40277388e-01, -1.23241689e-02,
       -1.62172408e+00, -9.02117965e-01,  1.70026266e-01,  1.23872278e+00,
        3.00034932e-01,  8.77217428e-01, -4.28254196e-01, -1.60384176e+00,
       -7.27758577e-01,  5.75339012e-01,  1.84002975e+00, -2.82762331e-01,
       -4.46689503e-01,  4.54598411e-01, -7.20925959e-01, -4.94958971e-01,
        1.83361358e+00,  5.41639029e-01, -2.37669615e-02,  6.91161817e-02,
       -1.16625399e+00,  1.47998363e+00, -5.24639431e-02,  2.29484969e-01,
        9.80085556e-01,  4.87309926e-01, -1.36829218e+00, -1.45687696e+00,
        6.29236519e-01,  3.96237597e-02, -1.36637113e-01, -8.87980543e-01,
        1.70098302e+00,  1.20626516e+00,  2.22293721e-01, -1.30343406e+00,
        1.21402625e-01, -7.37671565e-01,  1.24324714e+00, -1.06006414e+00,
        9.59501140e-01, -2.30747847e-01,  9.25549861e-02,  1.23926865e+00,
       -4.65883226e-02, -4.12507690e-01, -7.79592894e-02, -2.34582513e-01,
        2.04675826e+00, -1.90529405e+00,  1.03559580e+00, -1.29599878e-01,
       -9.13081280e-02,  1.32167985e+00, -7.82731387e-01, -1.29193227e-01,
        1.06190146e+00,  7.12800474e-02,  4.87489742e-01,  3.49450406e-01,
       -8.27049072e-01, -1.22200747e+00,  3.63325814e-01, -9.89588832e-01,
       -3.99031463e-01,  1.06271907e+00, -4.31001520e-01, -3.35374493e-01,
       -2.59420603e-01,  5.94133788e-01, -1.04866736e+00,  5.14124318e-01,
       -6.74788979e-01,  9.84543893e-01,  2.59130202e-01, -2.99614411e-01,
       -2.75028926e-01, -1.97154563e+00,  2.76552718e-01, -1.21348559e-01,
        4.23998677e-01,  9.99576446e-01, -5.97071914e-01,  6.27470600e-02,
       -1.66601703e+00, -6.69013944e-02,  3.12415661e-01,  1.55112924e+00,
       -8.89793886e-02,  8.85875678e-01,  7.13058616e-01, -1.98426571e-01,
       -2.65242984e-01, -2.52357526e-01,  6.00371300e-01, -2.08330454e-02,
       -5.72334494e-01,  1.41294710e+00,  1.41930339e+00, -1.97152614e-01,
        2.37624892e+00,  4.10624511e-01, -2.21481753e+00, -1.25978403e+00,
       -9.22850490e-01,  4.09233034e-01,  1.36508035e-02,  2.42267981e-01,
        1.37652942e+00,  2.04707159e-01,  2.55829270e+00,  1.43859514e+00,
       -8.53406856e-01,  2.75853110e-01, -1.55833580e+00,  1.87071033e+00,
       -2.96816075e-02,  1.46482987e+00, -2.70073097e-01,  2.22843795e-01,
       -1.73495332e+00, -1.79123868e+00,  2.55090536e-01, -5.59974244e-01,
       -1.19106010e+00,  1.45898740e+00,  1.12486047e+00, -3.05256139e+00,
        4.25047223e-01, -8.73451852e-01, -1.35230212e+00, -7.00146439e-01,
        3.14385902e-01, -2.12366454e-01, -8.71508302e-01, -1.30916258e+00,
       -1.72477038e+00, -2.90329443e-01, -4.21085409e-01,  6.05154984e-01,
        1.69788035e+00, -9.88034651e-01, -5.41483717e-01,  1.30337753e+00,
       -2.67124700e-01,  5.07921602e-01, -1.18395699e+00,  2.69626352e-01,
       -6.40309375e-01, -1.49689527e+00, -1.02137799e+00,  1.32697320e+00,
       -1.50832225e-01, -1.16704569e+00, -3.66238762e-01,  1.78498356e-01,
       -1.56367822e+00,  1.62769081e-01, -6.17314078e-01,  1.28822669e+00,
        1.38514589e+00,  1.15046967e+00,  2.88737467e-01, -4.03412949e-01,
        1.29210459e+00,  1.15792139e+00,  2.99769079e-01, -6.41471572e-01,
        1.27528759e+00,  1.31437480e-01, -3.45603323e-01,  1.20102478e+00])

In [58]:
cats = pd.qcut(data,4)
cats

[(0.00631, 0.591], (-3.3369999999999997, -0.651], (-0.651, 0.00631], (0.00631, 0.591], (-3.3369999999999997, -0.651], ..., (-0.651, 0.00631], (0.591, 3.577], (0.00631, 0.591], (-0.651, 0.00631], (0.591, 3.577]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.3369999999999997, -0.651] < (-0.651, 0.00631] < (0.00631, 0.591] < (0.591, 3.577]]

In [59]:
pd.value_counts(cats)

C:\Users\shyam\AppData\Local\Temp\ipykernel_12920\1485279302.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(cats)

(-3.3369999999999997, -0.651]    250
(-0.651, 0.00631]                250
(0.00631, 0.591]                 250
(0.591, 3.577]                   250
Name: count, dtype: int64

In [60]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(0.00631, 1.187], (-1.248, 0.00631], (-1.248, 0.00631], (0.00631, 1.187], (-3.3369999999999997, -1.248], ..., (-1.248, 0.00631], (1.187, 3.577], (0.00631, 1.187], (-1.248, 0.00631], (1.187, 3.577]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.3369999999999997, -1.248] < (-1.248, 0.00631] < (0.00631, 1.187] < (1.187, 3.577]]

# Detecting n filtering outliners

In [61]:
data = pd.DataFrame(np.random.randn(1000,4))
data

            0         1         2         3
0    0.287580 -0.370574  0.909957 -0.129304
1   -0.004854 -0.749599 -1.150362  0.279239
2    0.026134  0.787641 -0.329050  1.052395
3   -1.232495 -0.010449  0.409616  2.278230
4    0.778101  0.884371  0.986519 -0.178258
..        ...       ...       ...       ...
995  0.550412  0.349343 -1.028002 -2.282341
996  0.766920  0.458252  1.507505 -0.741712
997 -0.690742 -0.195222  0.146626 -1.009976
998  1.086992 -0.076574  1.803292 -0.090404
999 -0.165501  1.739893 -0.229780 -0.083877

[1000 rows x 4 columns]

In [62]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.005143     0.019643     0.042527    -0.054404
std       1.004336     0.978889     0.971768     1.020243
min      -2.999347    -3.186111    -3.507897    -2.964339
25%      -0.659353    -0.630791    -0.591754    -0.730021
50%      -0.012837     0.030979     0.065624    -0.097660
75%       0.645869     0.696513     0.708433     0.578846
max       3.293812     4.294978     3.035468     3.486695

In [63]:
col = data[2]
col

0      0.909957
1     -1.150362
2     -0.329050
3      0.409616
4      0.986519
         ...
995   -1.028002
996    1.507505
997    0.146626
998    1.803292
999   -0.229780
Name: 2, Length: 1000, dtype: float64

In [64]:
col[np.abs(col)>3]

339   -3.507897
435    3.035468
847   -3.333012
Name: 2, dtype: float64

In [65]:
data[(np.abs(data) > 3).any(axis=1)]

            0         1         2         3
173 -0.298458  0.594988  0.772039  3.486695
241  0.100473  1.047663 -1.069333  3.019715
339 -1.178524  0.257122 -3.507897 -1.545857
360  0.783584  4.294978  1.049759  0.483642
435 -0.664589  0.610001  3.035468 -2.928027
662  0.885851  3.181820 -0.367145 -1.105964
798  0.034476 -3.186111  0.691565  2.086348
847 -0.007694 -1.419145 -3.333012  0.627807
855  3.293812 -0.437603  0.823346  0.782997

In [66]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.004849     0.018352     0.043332    -0.054910
std       1.003415     0.972902     0.968829     1.018608
min      -2.999347    -3.000000    -3.000000    -2.964339
25%      -0.659353    -0.630791    -0.591754    -0.730021
50%      -0.012837     0.030979     0.065624    -0.097660
75%       0.645869     0.696513     0.708433     0.578846
max       3.000000     3.000000     3.000000     3.000000

In [67]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0  1.0 -1.0
1 -1.0 -1.0 -1.0  1.0
2  1.0  1.0 -1.0  1.0
3 -1.0 -1.0  1.0  1.0
4  1.0  1.0  1.0 -1.0

# String Manipulation

In [68]:
val = 'a,b,guido'
val

'a,b,guido'

In [69]:
val.split(',')

['a', 'b', 'guido']

In [70]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [71]:
'::'.join(pieces)

'a::b::guido'

In [72]:
'guido' in val

True

In [73]:
val.index(',')

1

In [74]:
val.find(':')

-1

In [75]:
val.count(',')

2

In [76]:
val.replace(',','::')

'a::b::guido'

In [77]:
val.replace(',','')

'abguido'

# Regular Expression

In [78]:
import re

In [79]:
text = "foo bar\t baz \tqux"
text

'foo bar\t baz \tqux'

In [80]:
re.split('\s+',text)

<>:1: SyntaxWarning: invalid escape sequence '\s'
<>:1: SyntaxWarning: invalid escape sequence '\s'
C:\Users\shyam\AppData\Local\Temp\ipykernel_12920\1971101977.py:1: SyntaxWarning: invalid escape sequence '\s'
  re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [81]:
regex = re.compile('\s+')
regex

<>:1: SyntaxWarning: invalid escape sequence '\s'
<>:1: SyntaxWarning: invalid escape sequence '\s'
C:\Users\shyam\AppData\Local\Temp\ipykernel_12920\2557403008.py:1: SyntaxWarning: invalid escape sequence '\s'
  regex = re.compile('\s+')

re.compile(r'\s+', re.UNICODE)

In [82]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [83]:
regex.findall(text)

[' ', '\t ', ' \t']

In [84]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

regex = re.compile(pattern, flags=re.IGNORECASE)
regex

re.compile(r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}', re.IGNORECASE|re.UNICODE)

In [85]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [86]:
m= regex.search(text)
m

In [87]:
text[m.start():m.end()]

'dave@google.com'

In [88]:
print(regex.match(text))

None

In [89]:
print(regex.sub('REDACTED',text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED